Q.1 Create a dataset as follow in the table.

In [1]:
import pandas as pd

data={
    "Tid":[1,2,3,4,5,6,7,8,9,10],
    "Refund":["yes","no","no","yes","no","no","yes","no","no","no"],
    "Martial Status":["single","married","single","married","divorced","married","divorced","single","married","single"],
    "Taxable Income":["125k","100k","70k","120k","95k","60k","220k","85k","75k","90k"],
    "Cheat":["no","no","no","no","yes","no","no","yes","no","yes"]
}
df=pd.DataFrame(data)
df

   Tid Refund Martial Status Taxable Income Cheat
0    1    yes         single           125k    no
1    2     no        married           100k    no
2    3     no         single            70k    no
3    4    yes        married           120k    no
4    5     no       divorced            95k   yes
5    6     no        married            60k    no
6    7    yes       divorced           220k    no
7    8     no         single            85k   yes
8    9     no        married            75k    no
9   10     no         single            90k   yes

Q.2 From the above table that you have created, locate row 0, 4, 7 and 8 using DataFrame

In [3]:
print(df.iloc[[0,4,7,8]])

   Tid Refund Martial Status Taxable Income Cheat
0    1    yes         single           125k    no
4    5     no       divorced            95k   yes
7    8     no         single            85k   yes
8    9     no        married            75k    no

Q.3 Navigate the DataFrame and do the following task for the table created in question 1: 
1. Select row from index 3 to 7. 
2. Select row from index 4 to 8, and column 2 to 4. 
3. Select all rows with column index 1 to 3 (include index 3 during selection).

In [5]:
print(df.iloc[3:8])
print(df.iloc[4:9,2:5])
print(df.iloc[:,1:4])

   Tid Refund Martial Status Taxable Income Cheat
3    4    yes        married           120k    no
4    5     no       divorced            95k   yes
5    6     no        married            60k    no
6    7    yes       divorced           220k    no
7    8     no         single            85k   yes
  Martial Status Taxable Income Cheat
4       divorced            95k   yes
5        married            60k    no
6       divorced           220k    no
7         single            85k   yes
8        married            75k    no
  Refund Martial Status Taxable Income
0    yes         single           125k
1     no        married           100k
2     no         single            70k
3    yes        married           120k
4     no       divorced            95k
5     no        married            60k
6    yes       divorced           220k
7     no         single            85k
8     no        married            75k
9     no         single            90k

Q.4 Read a csv file and display its first five rows.

In [50]:
import pandas as pd
file_path = r"C:\Users\dil\Downloads\Iris.csv"  
df = pd.read_csv(file_path)
print(df.head())

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

Q5. From the csv file (uploaded in the Q.4) delete row 4, and delete column 3. Display the result.

In [15]:
df.drop(4,axis=0,inplace=True)
df.drop(df.columns[3],axis=1,inplace=True)
print(df)

   Tid Refund Martial Status Cheat
0    1    yes         single    no
1    2     no        married    no
2    3     no         single    no
3    4    yes        married    no
5    6     no        married    no
6    7    yes       divorced    no
7    8     no         single   yes
8    9     no        married    no
9   10     no         single   yes

Q.6

In [17]:
data=pd.DataFrame({
    "Employee id":[101,102,103,104,105],
    "Name":["Alice","Bob","Charlie","Diana","Edward"],
    "Department":["HR","IT","IT","Marketing","Sales"],
    "Age":[29,34,41,28,38],
    "Salary":[50000,70000,65000,55000,60000],
    "Years_Of_Experience":[4,8,10,3,12],
    "Joining_Date":["2020-03-15","2017-07-19","2013-06-01","2021-02-10","2010-11-25"],
    "Gender":["Female","Male","Male","Female","Male"],
    "Bonus":[5000,7000,6000,4500,5000],
    "Rating":[4.5,4.0,3.8,4.7,3.5]
})
print(data)

   Employee id     Name Department  Age  Salary  Years_Of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

a) Shape (number of rows and columns) of the DataFrame. 
b) Summary of the DataFrame that includes the data types and non-null counts for 
each column. 
c) Generate descriptive statistics.

In [19]:
print(data.shape)
print(data.info())
print(data.describe())

(5, 10)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee id          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_Of_Experience  5 non-null      int64
 6   Joining_Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes
None
       Employee id        Age       Salary  Years_Of_Experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  34.000000  60000.00000             7.400000  5500.0
std       1.581139   5.612486   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  34.000000  60000.00000             8.000000  5000.0
75%     104.000000  38.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

d) Display the first 5 rows and last 3 rows of the dataset.

In [21]:
print(data.head(5))
print(data.tail(3))

   Employee id     Name Department  Age  Salary  Years_Of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5
   Employee id     Name Department  Age  Salary  Years_Of_Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

e) Calculate the following statistics from the dataset: 
i. The average salary of employees. 
ii. The total bonus paid to all employees. 
iii. The youngest employee's age. 
iv. The highest performance rating.

In [23]:
avg=data["Salary"].mean()
print(avg)

bonus=data["Bonus"].sum()
print(bonus)

y=data["Age"].min()
print(y)

rat=data["Rating"].max()
print(rat)

60000.0
27500
28
4.7

f) Sort the DataFrame by the Salary column in descending order.

In [25]:
sorted=data.sort_values(by="Salary",ascending=False)
print(sorted.head())

   Employee id     Name Department  Age  Salary  Years_Of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
4   2010-11-25    Male   5000     3.5
3   2021-02-10  Female   4500     4.7
0   2020-03-15  Female   5000     4.5

g) Add a new column that categorizes employees based on their performance rating: 
i. Excellent for ratings >= 4.5 
ii. Good for ratings >= 4.0 but < 4.5 
iii. Average for ratings < 4.0

In [27]:
def category(rating):
  if(rating>=4.5):
    return "Excellent"
  elif (rating>=4.0 and rating<4.5):
    return "Good"
  else:
    return "Average"

data["Performance"]=data["Rating"].apply(category)
print(data.head())

   Employee id     Name Department  Age  Salary  Years_Of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating Performance
0   2020-03-15  Female   5000     4.5   Excellent
1   2017-07-19    Male   7000     4.0        Good
2   2013-06-01    Male   6000     3.8     Average
3   2021-02-10  Female   4500     4.7   Excellent
4   2010-11-25    Male   5000     3.5     Average

h) Identify missing values in the DataFrame.

In [29]:
miss=data.isnull()
print(miss)

   Employee id   Name  Department    Age  Salary  Years_Of_Experience  \
0        False  False       False  False   False                False
1        False  False       False  False   False                False
2        False  False       False  False   False                False
3        False  False       False  False   False                False
4        False  False       False  False   False                False

   Joining_Date  Gender  Bonus  Rating  Performance
0         False   False  False   False        False
1         False   False  False   False        False
2         False   False  False   False        False
3         False   False  False   False        False
4         False   False  False   False        False

i) Rename the Employee_ID column to ID.

In [31]:
data.rename(columns={"Employee id":"ID"},inplace=True)
print(data.head())

    ID     Name Department  Age  Salary  Years_Of_Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2021-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   Gender  Bonus  Rating Performance
0  Female   5000     4.5   Excellent
1    Male   7000     4.0        Good
2    Male   6000     3.8     Average
3  Female   4500     4.7   Excellent
4    Male   5000     3.5     Average

j) Find all employees who: 
i. Have more than 5 years of experience. 
ii. Belong to the IT department.

In [33]:
print(data["Years_Of_Experience"]>5)
print(data["Department"]=="IT")

0    False
1     True
2     True
3    False
4     True
Name: Years_Of_Experience, dtype: bool
0    False
1     True
2     True
3    False
4    False
Name: Department, dtype: bool

k) Modify the dataset by adding a new column, Tax, which deducts 10% of the 
Salary.

In [35]:
data ["Tax"]=data["Salary"]*0.10
print(data.head())

    ID     Name Department  Age  Salary  Years_Of_Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2021-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   Gender  Bonus  Rating Performance     Tax
0  Female   5000     4.5   Excellent  5000.0
1    Male   7000     4.0        Good  7000.0
2    Male   6000     3.8     Average  6500.0
3  Female   4500     4.7   Excellent  5500.0
4    Male   5000     3.5     Average  6000.0

l) Save the modified DataFrame (with added columns) to a new CSV file.

In [37]:
data.to_csv("ans.csv",index=False)